anime_brawl_api/app/controllers/moves_controller.rb

  def index
    @moves = Move.all
---
SELECT "moves".* FROM "moves"

    def set_move
      @move = Move.find(params[:id])
---
SELECT "moves".* FROM "moves" WHERE "moves"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]