anime_brawl_api/app/controllers/movepools_controller.rb

  def index
    @movepools = Movepool.all
---
SELECT "movepools".* FROM "movepools"

    def set_movepool
      @movepool = Movepool.find(params[:id])
---
SELECT "movepools".* FROM "movepools" WHERE "movepools"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]